package io.khasang.bend.entity;

/*
главные функции админа школы:
1) искать учеников
2) назначать ученикам тренеров
3) заполнять информацию о школе(название, лого, фото, описание и т д)(это уже cущность School)(и ее филиалах? - вопрос сложности)
 */


public class Manager {//может лучше назвать эту роль админа школы - "менеджером", чтобы можно было потом создать глобального админа?

    //getCandidates();//поиск учеников со статусом в поиске, по дисциплинам
    //assignTrainerToStudent();//на создание записи в связующей таблице
    //unAssignTrainerFromStudent();//на удаление записи изсвязующей таблицы
}